[
  {
    "_id": "1",
    "_osi_protocol": "1",
    "_name_type": "optic fiber",
    "_dsc_type": "Utilise des fibres optiques pour transmettre des données à travers des signaux lumineux"
  },
  {
    "_id": "2",
    "_osi_protocol": "1",
    "_name_type": "ethernet/rj45",
    "_dsc_type": "Utilise des câbles Ethernet et des connecteurs RJ45 pour transmettre des données sur un réseau local"
  },
  {
    "_id": "3",
    "_osi_protocol": "2",
    "_name_type": "network card",
    "_dsc_type": "Carte réseau installée dans un ordinateur pour permettre la communication avec d'autres appareils sur un réseau"
  },
  {
    "_id": "4",
    "_osi_protocol": "2",
    "_name_type": "modem",
    "_dsc_type": "Convertit les signaux numériques d'un ordinateur en signaux analogiques pour la transmission sur un réseau de données analogiques"
  },
  {
    "_id": "5",
    "_osi_protocol": "2",
    "_name_type": "switch l2/l2+",
    "_dsc_type": "Un commutateur de couche 2 (L2) ou de couche 2+ (L2+) agit comme un pont intelligent, transmettant des trames en fonction des adresses MAC"
  },
  {
    "_id": "6",
    "_osi_protocol": "2",
    "_name_type": "switch l3",
    "_dsc_type": "Un commutateur de couche 3 (L3) fonctionne au niveau du réseau et utilise des adresses IP pour acheminer le trafic entre différents réseaux"
  },
  {
    "_id": "7",
    "_osi_protocol": "3",
    "_name_type": "wifi router",
    "_dsc_type": "Un routeur WiFi permet de connecter plusieurs appareils à un réseau local sans fil (WiFi) et de les relier à Internet"
  },
  {
    "_id": "8",
    "_osi_protocol": "7",
    "_name_type": "server",
    "_dsc_type": "Un serveur est un appareil ou un logiciel qui fournit des fonctionnalités ou des services à d'autres appareils, souvent dans le cadre d'un réseau informatique"
  },
  {
    "_id": "9",
    "_osi_protocol": "7",
    "_name_type": "general purpose",
    "_dsc_type": "Systèmes d'exploitation généraux tels que Linux et Windows. Cette catégorie est indiquée par l'absence de champ d// dans le fichier nmap-service-probes"
  },
  {
    "_id": "10",
    "_osi_protocol": "2",
    "_name_type": "bridge",
    "_dsc_type": "Un pont combine deux ou plusieurs sous-réseaux en un seul. Avec un pont, cela se produit à un niveau inférieur qu'avec un routeur. Cette catégorie inclut également des éléments comme les ponts Ethernet-to-serial"
  },
  {
    "_id": "11",
    "_osi_protocol": "3",
    "_name_type": "broadband router",
    "_dsc_type": "Les appareils de cette catégorie connectent un réseau à Internet via le câble, l'ADSL, la fibre optique, etc. Certains de ces appareils fournissent une traduction d'adresse réseau, un pare-feu, un transfert de port ou d'autres services"
  },
  {
    "_id": "12",
    "_osi_protocol": "4",
    "_name_type": "firewall",
    "_dsc_type": "Un pare-feu contrôle quel trafic est autorisé dans ou hors d'un réseau. Certains ont également des capacités supplémentaires. Cette catégorie n'inclut pas les systèmes d'exploitation généraux qui incluent un pare-feu, mais elle inclut les distributions d'OS construites uniquement pour fonctionner uniquement comme pare-feu"
  },
  {
    "_id": "13",
    "_osi_protocol": "7",
    "_name_type": "game console",
    "_dsc_type": "Une console de jeu vidéo comme la Xbox ou la PlayStation"
  },
  {
    "_id": "14",
    "_osi_protocol": "1",
    "_name_type": "hub",
    "_dsc_type": "Un concentrateur relie des segments de réseau en rebroadcastant tout le trafic. Les hubs sont distincts des commutateurs, qui transmettent sélectivement les paquets uniquement vers les destinations pertinentes"
  },
  {
    "_id": "15",
    "_osi_protocol": "4",
    "_name_type": "load balancer",
    "_dsc_type": "Un appareil qui distribue le trafic entrant à plusieurs appareils pour soulager la charge sur ces appareils"
  },
  {
    "_id": "16",
    "_osi_protocol": "7",
    "_name_type": "media device",
    "_dsc_type": "Cette catégorie inclut toutes sortes d'équipements audiovisuels, y compris les lecteurs de musique portables, les systèmes audio domestiques, les téléviseurs et les projecteurs"
  },
  {
    "_id": "17",
    "_osi_protocol": "7",
    "_name_type": "PBX",
    "_dsc_type": "Private Branch Exchange:\nUn autocommutateur privé, ou PBX, route les appels téléphoniques à l'intérieur d'une organisation privée et les connecte au réseau téléphonique public ou à la VoIP"
  },
  {
    "_id": "18",
    "_osi_protocol": "7",
    "_name_type": "PDA",
    "_dsc_type": "Personal Digital Assistant:\nUn ordinateur de poche. Les appareils qui sont également des téléphones vont dans la catégorie 'téléphone'"
  },
  {
    "_id": "19",
    "_osi_protocol": "7",
    "_name_type": "phone",
    "_dsc_type": " Un téléphone réseau capable qui n'est pas un téléphone VoIP. Les appareils de cette catégorie sont généralement des téléphones mobiles"
  },
  {
    "_id": "20",
    "_osi_protocol": "7",
    "_name_type": "power-device",
    "_dsc_type": "Divers dispositifs d'alimentation tels que les alimentations sans coupure et les parasurtenseurs"
  },
  {
    "_id": "21",
    "_osi_protocol": "7",
    "_name_type": "printer",
    "_dsc_type": "Imprimantes réseau, y compris les imprimantes avec un serveur d'impression intégré"
  },
  {
    "_id": "22",
    "_osi_protocol": "7",
    "_name_type": "print server",
    "_dsc_type": "Un serveur d'impression connecte une imprimante à un réseau. Les imprimantes qui contiennent leur propre serveur d'impression vont dans la catégorie 'imprimante' au lieu de cela"
  },
  {
    "_id": "23",
    "_osi_protocol": "7",
    "_name_type": "proxy server",
    "_dsc_type": "Tout type de proxy, y compris les proxies Web et autres serveurs qui mettent en cache des données ou comprennent des protocoles de haut niveau"
  },
  {
    "_id": "24",
    "_osi_protocol": "7",
    "_name_type": "remote management",
    "_dsc_type": "Des dispositifs qui permettent de surveiller ou de gérer à distance des serveurs ou d'autres équipements"
  },
  {
    "_id": "25",
    "_osi_protocol": "3",
    "_name_type": "router",
    "_dsc_type": "Les routeurs connectent plusieurs réseaux. Ils sont distincts des concentrateurs et des commutateurs car ils routent les paquets entre différents réseaux au lieu d'étendre un réseau"
  },
  {
    "_id": "26",
    "_osi_protocol": "7",
    "_name_type": "security-misc",
    "_dsc_type": "Tout dispositif de sécurité qui ne rentre pas dans la catégorie 'pare-feu' appartient à cette catégorie. Cela inclut la détection et la prévention des intrusions"
  },
  {
    "_id": "27",
    "_osi_protocol": "7",
    "_name_type": "specialized",
    "_dsc_type": "La catégorie fourre-tout. Si un appareil ne rentre dans aucune des autres catégories, il est spécialisé. Les exemples dans cette catégorie sont divers et comprennent des choses comme les horloges, les oscilloscopes, les capteurs climatiques, et plus encore"
  },
  {
    "_id": "28",
    "_osi_protocol": "7",
    "_name_type": "storage-misc",
    "_dsc_type": "Des dispositifs de stockage de données comme les lecteurs de bandes et les appareils de stockage en réseau"
  },
  {
    "_id": "29",
    "_osi_protocol": "2",
    "_name_type": "switch",
    "_dsc_type": "Un appareil qui étend un réseau en retransmettant sélectivement les paquets. Les commutateurs sont distincts des concentrateurs, qui diffusent tous les paquets"
  },
  {
    "_id": "30",
    "_osi_protocol": "7",
    "_name_type": "telecom-misc",
    "_dsc_type": "Des dispositifs utilisés par les systèmes téléphoniques qui ne sont pas des PBX, comme la messagerie vocale et les systèmes ISDN"
  },
  {
    "_id": "31",
    "_osi_protocol": "7",
    "_name_type": "terminal",
    "_dsc_type": "Un appareil avec un clavier et un écran ayant pour but principal de communiquer directement avec un serveur de terminaux ou un ordinateur central"
  },
  {
    "_id": "32",
    "_osi_protocol": "7",
    "_name_type": "terminal server",
    "_dsc_type": "Un appareil fournissant des installations de terminaux à des clients sur un réseau"
  },
  {
    "_id": "33",
    "_osi_protocol": "7",
    "_name_type": "VoIP adapter",
    "_dsc_type": "Un appareil qui convertit entre les protocoles de voix sur IP (VoIP) et le trafic téléphonique normal"
  },
  {
    "_id": "34",
    "_osi_protocol": "7",
    "_name_type": "VoIP phone",
    "_dsc_type": "Un téléphone capable d'un protocole VoIP"
  },
  {
    "_id": "35",
    "_osi_protocol": "3",
    "_name_type": "WAP",
    "_dsc_type": "Wireless Access Point:\nLes points d'accès sans fil offrent une connexion sans fil à un réseau. La plupart fonctionnent avec une technologie radio comme le 802.11b, mais certains utilisent des infrarouges ou autre chose. Les appareils qui pourraient également être mis dans une autre catégorie, comme les routeurs haut débit sans fil, sont mis dans la catégorie WAP car les WAP nécessitent des considérations réseau spéciales"
  },
  {
    "_id": "36",
    "_osi_protocol": "7",
    "_name_type": "webcam",
    "_dsc_type": "Tout type de caméra qui stocke ou transmet des images ou des vidéos. Cela inclut tout, des webcams grand public aux caméras de système de sécurité"
  }
]
